package com.core;

public class Chest {
    String item1;
    String item2;
    String item3;

    String[] weaponsM = {"Меч", "Моргинштерн", "Кортик", "Арбалет", "Лук", "Молот", "Топор", "Нож", "Кистень", "Серп",
    "Цеп", "Тесак", "Кинжал", "Шестопёр", "Трезубец", "Бердыш", "Буздыхан", "Пернач", "Молотило", "Шест"};
    String[] weaponsW = {"Булава", "Секира", "Сабля", "Алебарда", "Дубина", "Рогатина", "Праща", "Шпага",
            "Сасумата", "Нагамаки", "Палица", "Утренная звезда", "Нунчака", "Шалапуга", "Макила", "Палка"};
    String[] weaponsIt = {"Копьё", "Зубило", "Дробило", "Мачете", "Хоко", "Гасило"};

    String[] trashM = {"Канат", "Якорь", "Амулет", "Ключ"};
    String[] trashW = {"Чаша", "Трубка"};
    String[] trashIt = {"Ожерелье"};

    String[] nounsM = {"Холодный", "Неплохой", "Изящный", "Алый", "Вечный", "Пыльный",
            "Утренний", "Бешеный", "Славянский", "Арабский", "Жалкий", "Гигантский", "Огромный",
            "Чудовищный", "Гибельный", "Православный", "Мусульманский", "Острый",
            "Тупой", "Смешной", "Лихой", "Чудесный", "Богатый", "Расписной", "Ужасный", "Непристойный",
    "Кровожадный", "Священный"};//разное
    String[] nounsW = {"Ледяная", "Пригожая", "Изящная", "Кровавая", "Уродливая", "Кривая",
            "Ночная", "Яростная", "Славянская", "Арабская", "Ладная", "Гигантская", "Огромная",
            "Чудовищная", "Смертельная", "Православная", "Мусульманская", "Острая",
            "Тупая", "Злющая", "Колючая", "Призрачная", "Роскошная", "Расписная", "Музыкальная", "Извращенная",
            "Дьявольская", "Сумрачная", "Божественная"};//разное
    String[] nounsIt = {"Морозное", "Тяжелое", "Лютое", "Изогнутое", "Стальное", "Древнее", "Старое",
            "Полуночное", "Грязное", "Запачканное", "Славянское", "Арабское", "Сломанное", "Гигантское", "Огромное",
            "Чудовищное", "Брутальное", "Православное", "Мусульманское", "Острое",
            "Тупое", "Шипастое", "Славное", "Восхитительное", "Поганеое", "Грубое", "Гнилое", "Скверное",
            "Зловонное", "Святое"};//разное
    String[] nounsWhomM = {"ехидного", "чумного", "мощного", "чудного", "придурковатого", "старого", "пыльного",
            "бешенного", "славянского", "арабского", "гигантского", "огромного",
            "чудовищного", "опасного", "католического",
            "тупого", "придурковатого", "удалого", "богатого", "непристойного",
            "кровожадного", "честного", "хитрожопого", "жадного", "свирепого", "слепого", "сутулого",
            "патлатого", "косматого", "горластого", "окоченевшего", "обезумевшего", "аморальный" };
    String[] nounsWhomW = {"ревущей", "продажной", "скудоумной", "тощей", "безрассудной", "дряхлой"," вредной",
            "хитрой", "беззубой", "страшной", "прекрасной", "жадной", "страстной", "восточной",
            "заразной", "распутной", "слдавянской", "арабской", "чудовищной", "гадкой"};
    String[] whomM = {"офицера", "нищего", "смерти", "ублюдка", "матроса", "викинга",
    "лейтинанта", "судьи", "света", "убийцы", "чёрта", "узурпатора", "вояки", "лешего", "шакала", "горбуна"};
    String[] whomW = {"смерти", "желания", "бабки", "вдовы", "чертовщины", "чудовища", "крысы", "псины",
            "старухи", "суки", "крестьянки", "дылды", "монахини"};
    String[] characteristics = {"слабости", "бешенства", "скромности", "правды", "памяти", "ловкости", "мудрости",
    "силы", "истины"};

    public String chestOpen() {
        int randomNum = 1 + (int) (Math.random() * 8);
        String name = "Пусто";
        switch (randomNum) {
            case (1)://прил муж + оружие муж
                name = nounsM[(int) (Math.random() * (nounsM.length - 1))] +
                        " " + weaponsM[(int) (Math.random() * (weaponsM.length - 1))];
                break;
            case (2)://прил жен + оружие жен
                name = nounsW[(int) (Math.random() * (nounsW.length - 1))] +
                        " " + weaponsW[(int) (Math.random() * (weaponsW.length - 1))];
                break;
            case (3)://прил сред + оружие сред
                name = nounsIt[(int) (Math.random() * (nounsIt.length - 1))] +
                        " " + weaponsIt[(int) (Math.random() * (weaponsIt.length - 1))];
                break;
            case (4)://прил муж + оружие муж + характеристика
                name = nounsM[(int) (Math.random() * (nounsM.length - 1))] +
                        " " + weaponsM[(int) (Math.random() * (weaponsM.length - 1))]  +
                        " " + characteristics[(int) (Math.random() * (characteristics.length - 1))];
                break;
            case (5)://прил жен + оружие жен + характеристика
                name = nounsW[(int) (Math.random() * (nounsW.length - 1))] +
                        " " + weaponsW[(int) (Math.random() * (weaponsW.length - 1))]+
                        " " + characteristics[(int) (Math.random() * (characteristics.length - 1))];
                break;
            case (6)://прил сред + оружие сред + характеристика
                name = nounsIt[(int) (Math.random() * (nounsIt.length - 1))] +
                        " " + weaponsIt[(int) (Math.random() * (weaponsIt.length - 1))]+
                        " " + characteristics[(int) (Math.random() * (characteristics.length - 1))];
                break;
            case (7)://прил муж + оружие муж + кого прилаг муж + чьё муж
                name = nounsM[(int) (Math.random() * (nounsM.length - 1))] +
                        " " + weaponsM[(int) (Math.random() * (weaponsM.length - 1))]  +
                        " " + nounsWhomM[(int) (Math.random() * (nounsWhomM.length - 1))] +
                        " " + whomM[(int) (Math.random() * (whomM.length - 1))];
                break;
            case (8)://прил жен + оружие жен + кого прилаг жен + чьё жен
                name = nounsW[(int) (Math.random() * (nounsW.length - 1))] +
                        " " + weaponsW[(int) (Math.random() * (weaponsW.length - 1))]  +
                        " " + nounsWhomW[(int) (Math.random() * (nounsWhomW.length - 1))] +
                        " " + whomW[(int) (Math.random() * (whomW.length - 1))];
                break;

        }
        return name;
    }


    public Chest() {
        this.item1 = chestOpen();
        this.item2 = chestOpen();
        this.item3 = chestOpen();
        System.out.println(item1);;
        System.out.println(item2);;
        System.out.println(item3);;
    }
}
